class SkyParams:
    def __init__(self): 
        self.sky_params = {
            "n000": [
                "Чисте небо",
                "static/images/night_clear.jpg",
                (156, 156, 156, 0.503),
                (126, 126, 126, 0.652)
                ],

            "n100": [
                "Невелика хмарність",
                "static/images/night_cloudy.jpg",
                (115, 115, 115, 0.623),
                (67, 67, 67, 0.332)
                ],

            "n200": [
                "Мінлива хмарність",
                "static/images/night_cloudy.jpg",
                (115, 115, 115, 0.623),
                (67, 67, 67, 0.332)
                ],

            "n300": [
                "Хмарно з проясненнями",
                "static/images/night_cloudy.jpg",
                (115, 115, 115, 0.623),
                (67, 67, 67, 0.332)
                ],
            
            "n400": [
                "Хмарно",
                "static/images/night_cloudy.jpg",
                (115, 115, 115, 0.623),
                (67, 67, 67, 0.332)
                ],

            "n410": [
                "Хмарно, невеликий дощ",
                "static/images/night_rainly.jpeg",
                (60, 60, 60, 0.896),
                (160, 160, 160, 0.332)
                ],            
            
            "n420": [
                "Хмарно, дощ",
                "static/images/night_rainly.jpeg",
                (60, 60, 60, 0.896),
                (160, 160, 160, 0.332)
                ],

            "n430": [
                "Хмарно, дощ, місцями сильний",
                "static/images/night_rainly.jpeg",
                (60, 60, 60, 0.896),
                (160, 160, 160, 0.332)
                ],
            
            "n440": [
                "Хмарно, дощ, грози",
                "static/images/night_rainly.jpeg",
                (60, 60, 60, 0.896),
                (160, 160, 160, 0.332)
                ],
            


            "d000": [
                "Сонячно",
                "static/images/sunny.jpg",
                (175, 175, 175, 0.585),
                (111, 111, 111, 0.207)
                ],
            
            "d100": [
                "Невелика хмарність",
                "static/images/cloudy.jpeg",
                (83, 83, 83, 0.518),
                (176, 175, 175, 0.5)
                ],

            "d200": [
                "Мінлива хмарність",
                "static/images/cloudy.jpeg",
                (83, 83, 83, 0.518),
                (176, 175, 175, 0.5)
                ],

            "d210": [
                "Мінлива хмарність, невеликий дощ",
                "static/images/rainly.jpg",
                (55, 55, 55, 0.759),
                (160, 160, 160, 0.332)
                ],

            "d220": [
                "Мінлива хмарність, дощ",
                "static/images/rainly.jpg",
                (55, 55, 55, 0.759),
                (160, 160, 160, 0.332)
                ],

            "d240": [
                "Мінлива хмарність, дощ, можливі грози",
                "static/images/rainly.jpg",
                (55, 55, 55, 0.759),
                (160, 160, 160, 0.332)
                ],

            "d300": [
                "Хмарно з проясненнями",
                "static/images/cloudy.jpeg",
                (83, 83, 83, 0.518),
                (176, 175, 175, 0.5)
                ],

            "d310": [
                "Хмарно з проясненнями, невеликий дощ",
                "static/images/rainly.jpg",
                (55, 55, 55, 0.759),
                (160, 160, 160, 0.332)
                ],

            "d330": [
                "Хмарно з проясненнями, дощ, місцями сильний",
                "static/images/rainly.jpg",
                (55, 55, 55, 0.759),
                (160, 160, 160, 0.332)
                ],
            
            "d340": [
                "Хмарно з проясненнями, дощ, грози",
                "static/images/rainly.jpg",
                (55, 55, 55, 0.759),
                (160, 160, 160, 0.332)
                ],

             "d400": [
                "Хмарно",
                "static/images/cloudy.jpeg",
                (83, 83, 83, 0.518),
                (176, 175, 175, 0.5)
                ],

            "d410": [
                "Хмарно, невеликий дощ",
                "static/images/rainly.jpg",
                (55, 55, 55, 0.759),
                (160, 160, 160, 0.332)
                ],

            "d430": [
                "Хмарно, дощ, місцями сильний",
                "static/images/rainly.jpg",
                (55, 55, 55, 0.759),
                (160, 160, 160, 0.332)
                ],
            "d440": [
                "Хмарно, дощ, грози",
                "static/images/rainly.jpg",
                (55, 55, 55, 0.759),
                (160, 160, 160, 0.332)
                ],
        }